{
    "_meta": {
        "sources": [
            {
                "json": "M:Gen_Items",
                "abbreviation": "M:Gen_Items",
                "full": "Moon: Generic_Items",
                "authors": [
                    "Moon"
                ],
                "convertedBy": [
                    "Moon"
                ],
                "version": "1.4",
                "url": "https://github.com/LunaBarrett/Moon_Homebrew",
                "targetSchema": "1.0"
            },
            {
                "json": "M:Space_Items",
                "abbreviation": "M:Space_Items",
                "full": "Moon: Space_Items",
                "authors": [
                    "Moon"
                ],
                "convertedBy": [
                    "Moon"
                ],
                "version": "1.6",
                "url": "https://github.com/LunaBarrett/Moon_Homebrew",
                "targetSchema": "1.0"
            }
        ],
        "dateAdded": 0,
        "dateLastModified": 1718116284
    },
    "variant":[
        {
            "name": "Weapon of Reaching",
            "type": "GV",
            "requires": [
                {
                    "weapon": true,
                    "type": "M"

                }
            ],
            "excludes":{
                "net": true
            },
            "entries":[
                "Found mostly in the depths of dungeons, in dragons hoards or amongst armouries of ruined castles, these monsters take the forms of standard weapons of adventurers, hoping to be picked up and taken away.",
                "While their larger, chest shaped cousins are harmful to the average adventurer, these are far more helpful, choosing instead to gain sustenance from the wounds of enemies fought while in the hands of their wielder instead of the adventurer themselves.",
                "Their soft bodies can stretch and reform, which in combat gives the wielder a greater reach, and, if given enough time, can allow the wielder to entirely reshape the weapon into a different form to better suit their needs."
            ],
            "inherits": {
                "nameSuffix": " of Reaching",
                "source":"M:Gen_Items",
                "rarity":"uncommon",
                "entries":[
                    "You gain a +1 bonus to attack and damage rolls made with this magic weapon.",
                    "This weapon, due to its organic nature, can stretch as it is swung or thrust. It adds an additional 5 feet to your reach when you attack with it."
                ],
                "reqAttune": false,
                "bonusWeapon":"+1"
            },
            "source":"M:Gen_Items",
            "rarity":"uncommon"
        }
    ],
    "item":[{
        "name": "King's Trident of Returning Woe" ,
        "source": "M:Space_Items",
        "rarity": "rare",
        "entries": 
       [ 
           "You gain a +1 bonus to attack and damage rolls made with this magic weapon. It has the thrown property with a normal range of 20 feet and a long range of 60 feet. When you make a ranged attack using this weapon, a phantasmal blue outline of the trident is shot out, The Trident remains in the users hand.", "King's Lament: If the wielder of the {@item Queen's Trident of Returning Fury|M:Space_Items} drops to 0 hp within 60 feet of the you, you gain temporary hitpoints equal to PB number of hitdice, Alongside this, you fall into sorrow, with all attacks within 30 feet having dissadvantage, however you loose all buffs granted by allies because of your sadness."
       ],
        "reqAttune": true,
        "weaponCategory": "martial",
        "property": [
             "V","T"
       ],
        "baseItem": "Trident|phb",
        "dmg1": "1d6",
        "dmg2": "1d8",
        "dmgType": "P",
        "bonusWeapon": "+1"
   },
   {    
       "name": "Queens's Trident of Returning Fury" ,
        "source": "M:Space_Items",
        "rarity": "rare",
        "entries": 
       [
           "You gain a +1 bonus to attack and damage rolls made with this magic weapon. It has the thrown property with a normal range of 20 feet and a long range of 60 feet. When you make a ranged attack using this weapon, a phantasmal blue outline of the trident is shot out, The Trident remains in the users hand.", "Queen's Fury: If the wielder of the {@item King's Trident of Returning Woe|M:Space_Items} drops to 0 hp within 60 feet of the you, you gain temporary hitpoints equal to PB number of hitdice, Alongside this, you fall into mindless fury, gaining an extra attack per round that can only be used with a melee attack with this weapon, However if there are no enemies within your movement speed, you lash out, attacking the closest thing to you including allies. "
       ],
        "reqAttune": true,
        "weaponCategory": "martial",
        "property": [
           "V","T"
        ],
        "baseItem": "Trident|phb",
        "dmg1": "1d6",
        "dmg2": "1d8",
        "dmgType": "P",
        "bonusWeapon": "+1"
   },
   {
        "name": "Onyx Ring of Potential",
        "source": "M:Gen_Items",
        "rarity": "none",
        "value": 1,
        "weight": 0.1,
        "entries": [
            "a simple metal band with a smooth onyx set into it, it beckons to you to put it on to draw out its power."
        ]
        
    },
    {
        "name": "Dagger of Acid",
        "source": "M:Space_Items",
        "baseItem": "dagger|phb",
        "type": "M",
        "tier": "major",
        "rarity": "rare",
        "entries": [
            "You gain a +1 bonus to attack and damage rolls made with this magic weapon.",
            "You can use a bonus action to cause thick, orange acid to coat the blade. The acid remains for 1 minute or until an attack using this weapon hits a creature. That creature must succeed on a DC 15 Constitution saving throw or take {@damage 2d10} acid damage. The dagger can't be used this way again until the next dawn."
        ],
        "reqAttune": false,
        "weaponCategory": "simple",
        "property": [
            "F",
            "L",
            "T"
        ],
        "range": "20/60",
        "dmg1": "1d4",
        "dmgType": "P",
        "bonusWeapon": "+1"
    },
    {
        "name": "Dagger of Frost",
        "source": "M:Space_Items",
        "baseItem": "dagger|phb",
        "type": "M",
        "tier": "major",
        "rarity": "rare",
        "entries": [
            "You gain a +1 bonus to attack and damage rolls made with this magic weapon.",
            "You can use a bonus action to cause cold, brittle frost to coat the blade. The frost remains for 1 minute or until an attack using this weapon hits a creature. That creature must succeed on a DC 15 Constitution saving throw or take {@damage 2d10} cold damage. The dagger can't be used this way again until the next dawn."
        ],
        "reqAttune": false,
        "weaponCategory": "simple",
        "property": [
            "F",
            "L",
            "T"
        ],
        "range": "20/60",
        "dmg1": "1d4",
        "dmgType": "P",
        "bonusWeapon": "+1"
    },    
    {
        "name": "Dagger of Flames",
        "source": "M:Space_Items",
        "baseItem": "dagger|phb",
        "type": "M",
        "tier": "major",
        "rarity": "rare",
        "entries": [
            "You gain a +1 bonus to attack and damage rolls made with this magic weapon.",
            "You can use a bonus action to cause swirling, bright flames to coat the blade. The flames remains for 1 minute or until an attack using this weapon hits a creature. That creature must succeed on a DC 15 Constitution saving throw or take {@damage 2d10} fire damage. The dagger can't be used this way again until the next dawn."
        ],
        "reqAttune": false,
        "weaponCategory": "simple",
        "property": [
            "F",
            "L",
            "T"
        ],
        "range": "20/60",
        "dmg1": "1d4",
        "dmgType": "P",
        "bonusWeapon": "+1"
    },    
    {
        "name": "Dagger of Sparks",
        "source": "M:Space_Items",
        "baseItem": "dagger|phb",
        "type": "M",
        "tier": "major",
        "rarity": "rare",
        "entries": [
            "You gain a +1 bonus to attack and damage rolls made with this magic weapon.",
            "You can use a bonus action to cause crackling, energetic sparks to coat the blade. The sparks remains for 1 minute or until an attack using this weapon hits a creature. That creature must succeed on a DC 15 Constitution saving throw or take {@damage 2d10} lightning damage. The dagger can't be used this way again until the next dawn."
        ],
        "reqAttune": false,
        "weaponCategory": "simple",
        "property": [
            "F",
            "L",
            "T"
        ],
        "range": "20/60",
        "dmg1": "1d4",
        "dmgType": "P",
        "bonusWeapon": "+1"
    },
    {
        "name": "The Gift's Glint",
        "source": "M:Space_Items",
        "tier": "major",
        "rarity": "uncommon",
        "entries":[
            "You can use an attack to cause a beam of radiant light to shoot foward from the Gift to hit a creature. That creature must succeed on a DC 17 Constitution saving throw or becoming blinded until the start of the creatures next turn"
        ],
        "reqAttune":false,
        "range":"40/120",
        "dmg1":"3d8",
        "dmgType":"R"
    },
    {
        "name": "The Collector's Hilt",
        "source": "M:Space_Items",
        "tier": "major",
        "rarity": "rare",
        "entries":[
            "While attuned to this hilt, your psionic weapons can be manifested or vanished at-will, instead of when you take the Attack action or the following bonus action.",
            "You can use a bonus action on your turn to target a creature with your psionic abilities. Roll a psionic die, and for a number of turns equal to the number rolled you can read its surface level thoughts (as with the {@spell Detect Thoughts|PHB} spell) and, once per turn, learn one of its saving throw modifiers or a condition it is immune to. A creature protected from divination magic (such as with the {@spell Nondetection|PHB} spell) is immune to this effect. The first time you use this power after each long rest, you don't expend the Psionic Energy die. All other times you use the power, you expend the die.",
            "As a ten-minute ritual, this hilt can take on the abilities of any magical weapon by being placed over it, destroying the original. Performing this ritual a second time replaces the previous abilities with the abilities of the new magical weapon. Your psychic blades inherit the abilities of the hilt."
        ],
        "reqAttune": "by a soulknife rogue",
        "wondrous": true
    },
    {
        "name": "Crystallised Sunlight",
        "source": "M:Space_Items",
        "rarity": "none",
        "entries":[
            "A Fist sized rough gemstone of brilliant swirling orange and yellow hues, said to be solidified sunlight",
            "While close inspection reveales no magical properties, the Ooze threatening the city of Limbo seems to have an adversion to this material.",
            "One of the three materials required to craft {@item The Beacon of Illumination|M:Space_Items}"
        ],
        "weight": 0.5,
        "value": 5000
    },
    {
        "name": "Mimic's Blood",
        "source": "M:Space_Items",
        "entries":[
            "TBD"
        ]
    },
    {
        "name": "Lunar Dragon's Scale",
        "source": "M:Space_Items",
        "entries":[
            "TBD"
        ]
    },
    {
        "name": "The Beacon of Illumination",
        "source": "M:Space_Items",
        "tier":"major",
        "rarity":"very rare",
        "entries":[
            "An beautifully iridecent orb of light eminating out of a crystaline core, crafted from {@item Crystallised Sunlight|M:Space_Items}, {@item Mimic's Blood|M:Space_Items}, and a {@item Lunar Dragon's Scale|M:Space_Items}.",
            "The Beacon emits 150 feet of bright light and 150 feet of dim light, the light it emits shifts between deep oranges, reds, pinks, and yellows, mimicking a sunset.",
            "This light emmited drives back the Ooze plaguing the cosmos, any creature with the Ooze type under the control of ??? within 150 feet suffers the effect of {@classFeature Channel Divinity: Turn Undead|Cleric|PHB|2|PHB|Turn Undead} with a save DC of 21, automaticaly failing the save if the creature has a CR of 10 or lower."
        ],
        "wondrous":true,
        "weight":50,
        "value":25000
    },
    {
        "name": "Medusa's Eyes",
        "source": "M:Gen_Items",
        "entries":[
            "TBD"
        ]
    }
   ]
}